#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
; shader debug name: 1ea199eb26fd7012a9972a9dca1dac60.pdb
; shader hash: 1ea199eb26fd7012a9972a9dca1dac60
;
; Pipeline Runtime Information: 
;
;
;
; Vertex Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer Transform
; {
;
;   struct hostlayout.Transform
;   {
;
;       struct hostlayout.struct.TransformParam
;       {
;
;           column_major float4x4 World;              ; Offset:    0
;           column_major float4x4 View;               ; Offset:   64
;           column_major float4x4 Proj;               ; Offset:  128
;       
;       } Transform;                                  ; Offset:    0
;
;   
;   } Transform;                                      ; Offset:    0 Size:   192
;
; }
;
; Resource bind info for Vertices
; {
;
;   struct struct.MSInput

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !42)
!1 = !DIFile(filename: "..\5Cres\5CSimpleMS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 41, type: !18, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !30, !38}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, size: 96, align: 32, elements: !22, templateParams: !27)
!22 = !{!23, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !21, file: !1, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!27 = !{!28, !29}
!28 = !DITemplateTypeParameter(name: "element", type: !24)
!29 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!30 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 768, align: 32, elements: !36)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSOutput", file: !1, line: 13, size: 256, align: 32, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 15, baseType: !4, size: 128, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !32, file: !1, line: 16, baseType: !4, size: 128, align: 32, offset: 128)
!36 = !{!37}
!37 = !DISubrange(count: 3)
!38 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, align: 32, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 1)
!42 = !{!43, !58, !62}
!43 = !DIGlobalVariable(name: "Vertices", linkageName: "\01?Vertices@@3V?$StructuredBuffer@UMSInput@@@@A", scope: !0, file: !1, line: 32, type: !44, isLocal: false, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<MSInput>", file: !1, line: 32, size: 224, align: 32, elements: !2, templateParams: !45)
!45 = !{!46}
!46 = !DITemplateTypeParameter(name: "element", type: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "MSInput", file: !1, line: 4, size: 224, align: 32, elements: !48)
!48 = !{!49, !57}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !47, file: !1, line: 6, baseType: !50, size: 96, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 32, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 32, size: 96, align: 32, elements: !52, templateParams: !56)
!52 = !{!53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !51, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !51, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !51, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!56 = !{!13, !29}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !47, file: !1, line: 7, baseType: !4, size: 128, align: 32, offset: 96)
!58 = !DIGlobalVariable(name: "Indices", linkageName: "\01?Indices@@3V?$StructuredBuffer@V?$vector@I$02@@@@A", scope: !0, file: !1, line: 33, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "StructuredBuffer<vector<unsigned int, 3> >", file: !1, line: 33, size: 96, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !21)
!62 = !DIGlobalVariable(name: "Transform", linkageName: "\01?Transform@@3U?$ConstantBuffer@UTransformParam@@@@A", scope: !0, file: !1, line: 34, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<TransformParam>", file: !1, line: 34, size: 32, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "T", type: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "TransformParam", file: !1, line: 22, size: 1536, align: 32, elements: !67)
!67 = !{!68, !91, !92}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "World", scope: !66, file: !1, line: 24, baseType: !69, size: 512, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 34, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 34, size: 512, align: 32, elements: !71, templateParams: !88)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !70, file: !1, line: 34, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!88 = !{!13, !89, !90}
!89 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!90 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "View", scope: !66, file: !1, line: 25, baseType: !69, size: 512, align: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Proj", scope: !66, file: !1, line: 26, baseType: !69, size: 512, align: 32, offset: 1024)
!93 = !{i32 2, !"Dwarf Version", i32 4}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!96 = !{!"..\5Cres\5CSimpleMS.hlsl", !"//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0A// MSInput structure\0D\0A//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0Astruct MSInput\0D\0A{\0D\0A    float3 Position; // position coordinates\0D\0A    float4 Color; // color of vertices\0D\0A};\0D\0A\0D\0A//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0A// MSOutput structure\0D\0A//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0Astruct MSOutput\0D\0A{\0D\0A    float4 Position : SV_POSITION; // position coordinates\0D\0A    float4 Color : COLOR; // color of vertices\0D\0A};\0D\0A\0D\0A//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0A// TransformParam structure\0D\0A//////////////////////////////////////////////////////////////////////////////////////////////////////////\0D\0Astruct TransformParam\0D\0A{\0D\0A    float4x4 World; // world matrix\0D\0A    float4x4 View; // view matrix\0D\0A    float4x4 Proj; // projection matrix\0D\0A};\0D\0A\0D\0A//--------------------------------------------------------------------------------------------------------\0D\0A// Resources\0D\0A//--------------------------------------------------------------------------------------------------------\0D\0AStructuredBuffer<MSInput> Vertices : register(t0);\0D\0AStructuredBuffer<uint3> Indices : register(t1);\0D\0AConstantBuffer<TransformParam> Transform : register(b0);\0D\0A\0D\0A//--------------------------------------------------------------------------------------------------------\0D\0A//   main entry point of meshshader\0D\0A//--------------------------------------------------------------------------------------------------------\0D\0A[numthreads(64, 1, 1)]\0D\0A[outputtopology(\22triangle\22)]\0D\0Avoid main\0D\0A(\0D\0A    uint3 threadIndex : SV_DispatchThreadID,\0D\0A    out vertices MSOutput verts[3],\0D\0A    out indices uint3 tris[1]\0D\0A)\0D\0A{\0D\0A    // set the number of vertices and primitives of thread group\0D\0A    SetMeshOutputCounts(3, 1);\0D\0A    \0D\0A    // set vertex index\0D\0A    if (threadIndex.x < 1)\0D\0A    {\0D\0A        tris[threadIndex.x] = Indices[threadIndex.x];\0D\0A    }\0D\0A    \0D\0A    // set vertex data\0D\0A    if (threadIndex.x < 3)\0D\0A    {\0D\0A        MSOutput output = (MSOutput) 0;\0D\0A        \0D\0A        float4 localPos = float4(Vertices[threadIndex.x].Position, 1.f);\0D\0A        float4 worldPos = mul(Transform.World, localPos);\0D\0A        float4 viewPos = mul(Transform.View, worldPos);\0D\0A        float4 projPos = mul(Transform.Proj, viewPos);\0D\0A        \0D\0A        output.Position = projPos;\0D\0A        output.Color = Vertices[threadIndex.x].Color;\0D\0A        \0D\0A        verts[threadIndex.x] = output;\0D\0A    }\0D\0A}"}
!97 = !{!"..\5Cres\5CSimpleMS.hlsl"}
!98 = !{!"-E", !"main", !"-T", !"ms_6_5", !"/Fo", !"C:\5CUsers\5Cprolab\5Csource\5Crepos\5CCycloneFox19\5CReLearnD3D12\5CFramework\5Cproject\5C..\5Cbin\5Cx64\5CDebug\5CSimpleMS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!99 = !{i32 1, i32 5}
!100 = !{i32 1, i32 6}
!101 = !{!"ms", i32 6, i32 5}
!102 = !{!103, null, !108, null}
!103 = !{!104, !106}
!104 = !{i32 0, %"class.StructuredBuffer<MSInput>"* undef, !"Vertices", i32 0, i32 0, i32 1, i32 12, i32 0, !105}
!105 = !{i32 1, i32 28}
!106 = !{i32 1, %"class.StructuredBuffer<vector<unsigned int, 3> >"* undef, !"Indices", i32 0, i32 1, i32 1, i32 12, i32 0, !107}
!107 = !{i32 1, i32 12}
!108 = !{!109}
